[
  {
    "text": "5. Citizenship at the commencement of the Constitution. — At the commencement of this Constitution, every person who has his domicile in the territory of India and — (a) who was born in the territory of India; or (b) either of whose parents was born in the territory of India; or (c) who has been ordinarily resident in the territory of India for not less than five years immediately preceding such commencement, shall be a citizen of India.",
    "metadata": {
      "article": "5",
      "part": "Part II - Citizenship",
      "tags": [
        "citizenship",
        "domicile",
        "residency",
        "birth in india",
        "parents",
        "national identity",
        "rights"
      ]
    }
  },
  {
    "text": "6. Rights of citizenship of certain persons who have migrated to India from Pakistan. — Notwithstanding anything in article 5, a person who has migrated to the territory of India from the territory now included in Pakistan shall be deemed to be a citizen of India at the commencement of this Constitution if — (a) he or either of his parents or any of his grandparents was born in India as defined in the Government of India Act, 1935 (as originally enacted); and (b)(i) in the case where such person has so migrated before the nineteenth day of July, 1948, he has been ordinarily resident in the territory of India since the date of his migration, or (ii) in the case where such person has so migrated on or after the nineteenth day of July, 1948, he has been registered as a citizen of India by an officer appointed in that behalf by the Government of the Dominion of India on an application made by him therefor to such officer before the commencement of this Constitution in the form and manner prescribed by that Government: Provided that no person shall be so registered unless he has been resident in the territory of India for at least six months immediately preceding the date of his application.",
    "metadata": {
      "article": "6",
      "part": "Part II - Citizenship",
      "tags": [
        "citizenship",
        "migration",
        "pakistan",
        "birth in india",
        "residency",
        "registration",
        "refugees",
        "rights"
      ]
    }
  },
  {
    "text": "7. Rights of citizenship of certain migrants to Pakistan. — Notwithstanding anything in articles 5 and 6, a person who has, after the first day of March, 1947, migrated from the territory of India to the territory now included in Pakistan shall not be deemed to be a citizen of India.",
    "metadata": {
      "article": "7",
      "part": "Part II - Citizenship",
      "tags": [
        "citizenship",
        "migration",
        "pakistan",
        "loss of rights",
        "partition",
        "nationality",
        "emigration"
      ]
    }
  },
  {
    "text": "12. Definition. — In this Part, unless the context otherwise requires, “the State” includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India.",
    "metadata": {
      "article": "12",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "state definition",
        "government",
        "public authorities",
        "parliament",
        "fundamental rights",
        "rights",
        "jurisdiction"
      ]
    }
  },
  {
    "text": "13. Laws inconsistent with or in derogation of the fundamental rights. — (1) All laws in force in the territory of India immediately before the commencement of this Constitution, in so far as they are inconsistent with the provisions of this Part, shall, to the extent of such inconsistency, be void. (2) The State shall not make any law which takes away or abridges the rights conferred by this Part and any law made in contravention of this clause shall, to the extent of the contravention, be void.",
    "metadata": {
      "article": "13",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "fundamental rights",
        "invalid laws",
        "constitutional rights",
        "legal protection",
        "void laws",
        "citizen rights"
      ]
    }
  },
  {
    "text": "14. Equality before law. — The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India.",
    "metadata": {
      "article": "14",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "equality",
        "equal rights",
        "no discrimination",
        "equal treatment",
        "rule of law",
        "citizen rights"
      ]
    }
  },
  {
    "text": "15. Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth. — (1) The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them.",
    "metadata": {
      "article": "15",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "no discrimination",
        "religion",
        "caste",
        "gender equality",
        "human rights",
        "equal rights",
        "birthplace discrimination"
      ]
    }
  },
  {
    "text": "16. Equality of opportunity in matters of public employment. — (1) There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State.",
    "metadata": {
      "article": "16",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "job equality",
        "public employment",
        "equal opportunity",
        "government jobs",
        "employment rights",
        "no discrimination"
      ]
    }
  },
  {
    "text": "17. Abolition of Untouchability. — “Untouchability” is abolished and its practice in any form is forbidden. The enforcement of any disability arising out of “Untouchability” shall be an offence punishable in accordance with law.",
    "metadata": {
      "article": "17",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "untouchability",
        "caste discrimination",
        "social equality",
        "fundamental rights",
        "human dignity",
        "equality"
      ]
    }
  },
  {
    "text": "18. Abolition of titles. — (1) No title, not being a military or academic distinction, shall be conferred by the State. (2) No citizen of India shall accept any title from any foreign State. (3) No person who is not a citizen of India shall, while he holds any office of profit or trust under the State, accept without the consent of the President any title from any foreign State. (4) No person holding any office of profit or trust under the State shall, without the consent of the President, accept any present, emolument, or office of any kind from or under any foreign State.",
    "metadata": {
      "article": "18",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "abolition of titles",
        "no foreign titles",
        "equality",
        "national dignity",
        "titles and honours",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "19. Protection of certain rights regarding freedom of speech, etc. — (1) All citizens shall have the right — (a) to freedom of speech and expression; (b) to assemble peaceably and without arms; (c) to form associations or unions; (d) to move freely throughout the territory of India; (e) to reside and settle in any part of the territory of India; and (f) to practise any profession, or to carry on any occupation, trade or business. (2)...",
    "metadata": {
      "article": "19",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "freedom of speech",
        "freedom of movement",
        "freedom to assemble",
        "freedom of profession",
        "civil rights",
        "fundamental rights",
        "freedom of expression"
      ]
    }
  },
  {
    "text": "22(2). Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty-four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate and no such person shall be detained in custody beyond the said period without the authority of a magistrate.",
    "metadata": {
      "article": "22",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "arrest rights",
        "legal custody",
        "right to be presented before magistrate",
        "detention rights",
        "criminal justice",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "22(3). Nothing in clauses (1) and (2) shall apply— (a) to any person who for the time being is an enemy alien; or (b) to any person who is arrested or detained under any law providing for preventive detention.",
    "metadata": {
      "article": "22",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "preventive detention",
        "enemy alien",
        "exceptions to arrest rights",
        "detention laws",
        "criminal law",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "22(2). Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty-four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate and no such person shall be detained in custody beyond the said period without the authority of a magistrate.",
    "metadata": {
      "article": "22",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "arrest rights",
        "magistrate production",
        "detention rules",
        "criminal procedure",
        "legal custody",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "22(3). Nothing in clauses (1) and (2) shall apply— (a) to any person who for the time being is an enemy alien; or (b) to any person who is arrested or detained under any law providing for preventive detention.",
    "metadata": {
      "article": "22",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "preventive detention",
        "enemy alien",
        "exceptions to due process",
        "national security",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "22(4). No law providing for preventive detention shall authorise the detention of a person for a longer period than three months unless (a) an Advisory Board consisting of persons who are, or have been, or are qualified to be appointed as, Judges of a High Court has reported before the expiration of the said period of three months that there is in its opinion sufficient cause for such detention. Note: Clause (4) may be substituted by the Constitution (Forty-fourth Amendment) Act, 1978. The substituted clause proposes: No law providing for preventive detention shall authorise the detention of a person for a longer period than two months unless an Advisory Board constituted in accordance with the recommendations of the Chief Justice of the appropriate High Court has reported before the expiration of the said period that there is in its opinion sufficient cause for such detention. The Board shall consist of a Chairman and not less than two other members, and the Chairman shall be a serving Judge of the appropriate High Court and the other members shall be serving or retired Judges of any High Court. Nothing in this clause shall authorise the detention of any person beyond the maximum period prescribed by any law made by Parliament. 'Appropriate High Court' means (i) in the case of detention under the Government of India, the High Court for the Union territory of Delhi; (ii) under a State Government, the High Court for that State; and (iii) under a Union territory, the High Court as specified by law.",
    "metadata": {
      "article": "22",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "preventive detention limit",
        "advisory board",
        "judicial oversight",
        "detention rules",
        "constitutional safeguards",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "23. Right against Exploitation: (1) Traffic in human beings and begar and other similar forms of forced labour are prohibited and any contravention of this provision shall be an offence punishable in accordance with law. (2) Nothing in this article shall prevent the State from imposing compulsory service for public purposes, and in imposing such service the State shall not make any discrimination on grounds only of religion, race, caste, language or any of them.",
    "metadata": {
      "article": "23",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "right against exploitation",
        "human trafficking",
        "forced labour",
        "begar",
        "compulsory service",
        "non-discrimination",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "29(2). No citizen shall be denied admission into any educational institution maintained by the State or receiving aid out of State funds on grounds only of religion, race, caste, language or any of them.",
    "metadata": {
      "article": "29(2)",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "educational rights",
        "non-discrimination",
        "equal access to education",
        "caste and religion",
        "language rights",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "31A (Explanation II). The expression 'rights', in relation to an estate, shall include any rights vesting in a proprietor, sub-proprietor, under-proprietor, tenure-holder, raiyat, under-raiyat or other intermediary and any rights or privileges in respect of land revenue.",
    "metadata": {
      "article": "31A",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "property rights",
        "land ownership",
        "estate rights",
        "agricultural land",
        "land revenue",
        "land reform"
      ]
    }
  },
  {
    "text": "31B. Validation of certain Acts and Regulations.—Without prejudice to the generality of the provisions contained in article 31A, none of the Acts and Regulations specified in the Ninth Schedule nor any of the provisions thereof shall be deemed to be void, or ever to have become void, on the ground that such Act, Regulation or provision is inconsistent with, or takes away or abridges any of the rights conferred by any provisions of this Part; and notwithstanding any judgment, decree or order of any court or Tribunal to the contrary, each of the said Acts and Regulations shall, subject to the power of any competent Legislature to repeal or amend it, continue in force.",
    "metadata": {
      "article": "31B",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "ninth schedule",
        "validation of laws",
        "constitutional immunity",
        "land reform laws",
        "judicial review",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "31C. Saving of laws giving effect to certain directive principles.—Notwithstanding anything contained in article 13, no law giving effect to the policy of the State towards securing all or any of the principles laid down in Part IV shall be deemed to be void on the ground that it is inconsistent with, or takes away or abridges any of the rights conferred by article 14 or article 19; and no law containing a declaration that it is for giving effect to such policy shall be called in question in any court on the ground that it does not give effect to such policy: Provided that where such law is made by the Legislature of a State, the provisions of this article shall not apply thereto unless such law, having been reserved for the consideration of the President, has received his assent.",
    "metadata": {
      "article": "31C",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "directive principles override",
        "article 14 and 19 exception",
        "laws protecting DPSP",
        "constitutional immunity",
        "policy implementation",
        "fundamental rights"
      ]
    }
  },
  {
    "text": "32. Right to Constitutional Remedies — The right to constitutional remedies is a fundamental right enshrined in the Constitution of India. It ensures that any citizen can approach the Supreme Court or High Court for the enforcement of fundamental rights guaranteed by the Constitution.",
    "metadata": {
      "article": "32",
      "part": "Part III - Fundamental Rights",
      "tags": [
        "constitutional remedies",
        "writ petition",
        "enforcement of rights",
        "access to courts",
        "fundamental rights protection",
        "article 32"
      ]
    }
  },
  {
    "text": "170(3). Upon the completion of each census, the total number of seats in the Legislative Assembly of each State and the division of each State into territorial constituencies shall be readjusted by such authority and in such manner as Parliament may by law determine: Provided that such readjustment shall not affect representation in the Legislative Assembly until the dissolution of the then existing Assembly.",
    "metadata": {
      "article": "170",
      "part": "Part VI - The States",
      "tags": [
        "assembly seat readjustment",
        "census and representation",
        "constituency division",
        "legislative assembly",
        "delimitation",
        "population-based representation"
      ]
    }
  },
  {
    "text": "178. The Speaker and Deputy Speaker of the Legislative Assembly.—Every Legislative Assembly of a State shall, as soon as may be, choose two members of the Assembly to be respectively Speaker and Deputy Speaker thereof and, so often as the office of Speaker or Deputy Speaker becomes vacant, the Assembly shall choose another member to be Speaker or Deputy Speaker, as the case may be.",
    "metadata": {
      "article": "178",
      "part": "Part VI - The States",
      "tags": [
        "speaker of assembly",
        "deputy speaker",
        "legislative leadership",
        "assembly procedures",
        "state legislature roles"
      ]
    }
  },
  {
    "text": "173. A person shall not be qualified to be chosen to fill a seat in the Legislature of a State unless he—(b) in the case of a seat in the Legislative Assembly, is not less than twenty-five years of age, and in the case of a seat in the Legislative Council, is not less than thirty years of age; and (c) possesses such other qualifications as may be prescribed in that behalf by or under any law made by Parliament.",
    "metadata": {
      "article": "173",
      "part": "Part VI - The States",
      "tags": [
        "eligibility criteria",
        "minimum age",
        "state legislature",
        "legislative assembly qualifications",
        "legislative council qualifications"
      ]
    }
  },
  {
    "text": "There shall be paid to the Speaker and the Deputy Speaker of the Legislative Assembly and to the Chairman and the Deputy Chairman of the Legislative Council such salaries and allowances as may respectively be fixed by the Legislature of the State by law and, until provision in that behalf is so made, such salaries and allowances as are specified in the Second Schedule.",
    "metadata": {
      "article": "186",
      "part": "Part VI - The States",
      "tags": [
        "speaker and chairman salaries",
        "legislature allowances",
        "remuneration of legislators",
        "second schedule",
        "state assembly and council"
      ]
    }
  },
  {
    "text": "A person shall be disqualified for being chosen as, and for being, a member of the Legislative Assembly or Legislative Council of a State—(a) if he holds any office of profit under the Government of India or the Government of any State, other than an office declared by the Legislature of the State by law not to disqualify its holder; (b) if he is of unsound mind and stands so declared by a competent court; (c) if he is an undischarged insolvent; (d) if he is not a citizen of India, or has voluntarily acquired the citizenship of a foreign State; (e) if he is so disqualified by or under any law made by Parliament.",
    "metadata": {
      "article": "191",
      "part": "Part VI - The States",
      "tags": [
        "disqualification grounds",
        "office of profit",
        "citizenship disqualification",
        "mental health and insolvency",
        "state legislature disqualification"
      ]
    }
  },
  {
    "text": "If any question arises as to whether a member of a House of the Legislature of a State has become subject to any of the disqualifications mentioned in clause (1) of article 191, the question shall be referred for the decision of the Governor and his decision shall be final.",
    "metadata": {
      "article": "192",
      "part": "Part VI - The States",
      "tags": [
        "disqualification decision",
        "governor's authority",
        "state legislature",
        "article 191 reference",
        "eligibility review"
      ]
    }
  },
  {
    "text": "If a person sits or votes as a member of the Legislative Assembly or the Legislative Council of a State before he has complied with the requirements of article 188, or when he knows that he is not qualified or that he is disqualified for membership thereof, or that he is prohibited from so doing by any law made by Parliament or the Legislature of the State, he shall be liable in respect of each day on which he so sits or votes to a penalty of five hundred rupees to be recovered as a debt due to the State.",
    "metadata": {
      "article": "193",
      "part": "Part VI - The States",
      "tags": [
        "unauthorized voting penalty",
        "membership disqualification",
        "legislative misconduct",
        "legislature rules",
        "article 193"
      ]
    }
  },
  {
    "text": "Subject to the provisions of this Constitution and to the rules and standing orders regulating the procedure of the Legislature, there shall be freedom of speech in the Legislature of every State.",
    "metadata": {
      "article": "194",
      "part": "Part VI - The States",
      "tags": [
        "legislative privileges",
        "freedom of speech in assembly",
        "state legislature rights",
        "procedural autonomy",
        "article 194"
      ]
    }
  },
  {
    "text": "199. Definition of 'Money Bills'.—(1) For the purposes of this Chapter, a Bill shall be deemed to be a Money Bill if it contains only provisions dealing with all or any of the following matters, namely: (a) the imposition, abolition, remission, alteration or regulation of any tax; (b) the regulation of the borrowing of money or the giving of any guarantee by the State, or the amendment of the law with respect to any financial obligations undertaken or to be undertaken by the State; (c) the custody of the Consolidated Fund or the Contingency Fund of the State, the payment of moneys into or the withdrawal of moneys from any such Fund; (d) the appropriation of moneys out of the Consolidated Fund of the State; (e) the declaring of any expenditure to be expenditure charged on the Consolidated Fund of the State, or the increasing of the amount of any such expenditure; (f) the receipt of money on account of the Consolidated Fund of the State or the public account of the State or the custody or issue of such money; or (g) any matter incidental to any of the matters specified in sub-clauses (a) to (f). (2) A Bill shall not be deemed to be a Money Bill by reason only that it provides for the imposition of fines or other pecuniary penalties, or for the demand or payment of fees for licences or fees for services rendered, or by reason that it provides for the imposition, abolition, remission, alteration or regulation of any tax by any local authority or body for local purposes. (3) If any question arises whether a Bill introduced in the Legislature of a State which has a Legislative Council is a Money Bill or not, the decision of the Speaker of the Legislative Assembly of such State thereon shall be final.",
    "metadata": {
      "article": "199",
      "part": "Part VI - The States",
      "tags": [
        "money bills definition",
        "financial legislation",
        "state budgeting",
        "consolidated fund",
        "speaker authority",
        "article 199"
      ]
    }
  },
  {
    "text": "200. Assent to Bills.—When a Bill has been passed by the Legislative Assembly of a State or, in the case of a State having a Legislative Council, has been passed by both Houses of the Legislature of the State, it shall be presented to the Governor and the Governor shall declare either that he assents to the Bill or that he withholds assent therefrom or that he reserves the Bill for the consideration of the President: Provided that the Governor may, as soon as possible after the presentation to him of the Bill for assent, return the Bill if it is not a Money Bill together with a message requesting that the House or Houses will reconsider the Bill or any specified provisions thereof and, in particular, will consider the desirability of introducing any such amendments as he may recommend in his message and, when a Bill is so returned, the House or Houses shall reconsider the Bill accordingly, and if the Bill is passed again by the House or Houses with or without amendment and presented to the Governor for assent, the Governor shall not withhold assent therefrom.",
    "metadata": {
      "article": "200",
      "part": "Part VI - The States",
      "tags": [
        "governor assent",
        "bill passage",
        "state legislative procedure",
        "return of bill",
        "president consideration",
        "article 200"
      ]
    }
  },
  {
    "text": "204. Appropriation Bills.—No money shall be withdrawn from the Consolidated Fund of the State except under appropriation made by law passed in accordance with the provisions of this article.",
    "metadata": {
      "article": "204",
      "part": "Part VI - The States",
      "tags": [
        "appropriation bills",
        "consolidated fund of state",
        "state budget laws",
        "financial legislation",
        "article 204"
      ]
    }
  },
  {
    "text": "205. Votes on account, votes of credit and exceptional grants.—(1) Notwithstanding anything in the foregoing provisions of this Chapter, the Legislative Assembly of a State shall have power—(a) to make any grant in advance in respect of the estimated expenditure for a part of any financial year pending the completion of the procedure prescribed in article 203 for the voting of such grant and the passing of the law in accordance with the provisions of article 204 in relation to that expenditure; (b) to make a grant for meeting an unexpected demand upon the resources of the State when on account of the magnitude or the indefinite character of the service the demand cannot be stated with the details ordinarily given in an annual financial statement; (c) to make an exceptional grant which forms no part of the current service of any financial year; and the Legislature of the State shall have power to authorise by law the withdrawal of moneys from the Consolidated Fund of the State for the purposes for which the said grants are made. (2) The provisions of articles 203 and 204 shall have effect in relation to the making of any grant under clause (1) and to any law to be made under that clause as they have effect in relation to the making of a grant with regard to any expenditure mentioned in the annual financial statement and the law to be made.",
    "metadata": {
      "article": "205",
      "part": "Part VI - The States",
      "tags": [
        "votes on account",
        "exceptional grants",
        "advance grants",
        "state financial powers",
        "article 205"
      ]
    }
  },
  {
    "text": "There shall be a High Court for each State.",
    "metadata": {
      "article": "208",
      "part": "Part VI - The States",
      "tags": [
        "high court establishment",
        "state judiciary",
        "judicial structure",
        "article 208"
      ]
    }
  },
  {
    "text": "Every High Court shall be a court of record and shall have all the powers of such a court including the power to punish for contempt of itself.",
    "metadata": {
      "article": "210",
      "part": "Part VI - The States",
      "tags": [
        "high court powers",
        "court of record",
        "contempt of court",
        "judicial authority",
        "article 210"
      ]
    }
  },
  {
    "text": "Every Judge of a High Court shall be appointed by the President by warrant under his hand and seal after consultation with the Chief Justice of India, the Governor of the State, and, in the case of appointment of a Judge other than the Chief Justice, the Chief Justice of the High Court, and shall hold office, in the case of an additional or acting Judge, as provided in article 224, and in any other case until he attains the age of sixty-two years.",
    "metadata": {
      "article": "215",
      "part": "Part VI - The States",
      "tags": [
        "high court appointments",
        "judicial appointments",
        "presidential appointment",
        "chief justice consultation",
        "article 215"
      ]
    }
  },
  {
    "text": "A person shall not be qualified for appointment as a Judge of a High Court unless he is a citizen of India and—(a) has for at least ten years held a judicial office in the territory of India; or (b) has for at least ten years been an advocate of a High Court or of two or more such Courts in succession.",
    "metadata": {
      "article": "216",
      "part": "Part VI - The States",
      "tags": [
        "high court qualifications",
        "judge eligibility",
        "judicial qualifications",
        "article 216"
      ]
    }
  },
  {
    "text": "Clause (1) of Article 216 was omitted by the Constitution (Seventh Amendment) Act, 1956, section 29 and Schedule (w.e.f. 1-11-1956).",
    "metadata": {
      "article": "216",
      "part": "Part VI - The States",
      "tags": [
        "constitutional amendment",
        "seventh amendment",
        "article changes",
        "historical revisions",
        "article 216"
      ]
    }
  },
  {
    "text": "Clauses (2) and (3) were omitted by section 29 and Schedule of the Constitution (Seventh Amendment) Act, 1956 (w.e.f. 1-11-1956).",
    "metadata": {
      "article": "209",
      "part": "Part VI - The States",
      "tags": [
        "constitutional amendment",
        "seventh amendment",
        "omitted clauses",
        "historical provisions",
        "article 209"
      ]
    }
  },
  {
    "text": "Proviso to Article 215 was omitted by the Constitution (Seventh Amendment) Act, 1956, section 11 (w.e.f. 1-11-1956).",
    "metadata": {
      "article": "215",
      "part": "Part VI - The States",
      "tags": [
        "constitutional amendment",
        "seventh amendment",
        "omitted proviso",
        "article 215",
        "historical revision"
      ]
    }
  },
  {
    "text": "The words relating to the National Judicial Appointments Commission were substituted by the Constitution (Ninety-ninth Amendment) Act, 2014, section 6, but this amendment was struck down by the Supreme Court in the case of Supreme Court Advocates-on-Record Association and Another Vs. Union of India, judgment dated 16-10-2015, AIR 2016 SC 117.",
    "metadata": {
      "article": "215",
      "part": "Part VI - The States",
      "tags": [
        "NJAC",
        "ninety-ninth amendment",
        "judicial review",
        "supreme court judgment",
        "article 215"
      ]
    }
  },
  {
    "text": "The age limit 'sixty years' in Article 215 was substituted by the Constitution (Seventh Amendment) Act, 1956, section 12 (w.e.f. 1-11-1956), and later by the Constitution (Fifteenth Amendment) Act, 1963, section 4(a), to 'sixty-two years' (w.e.f. 5-10-1963).",
    "metadata": {
      "article": "215",
      "part": "Part VI - The States",
      "tags": [
        "judge retirement age",
        "seventh amendment",
        "fifteenth amendment",
        "constitutional amendment",
        "article 215"
      ]
    }
  },
  {
    "text": "If any High Court is satisfied that a case pending in a court subordinate to it involves a substantial question of law as to the interpretation of this Constitution, the determination of which is necessary for the disposal of the case, it shall withdraw the case and may either dispose of the case itself or determine the said question of law and return the case to the court from which the case has been so withdrawn together with a copy of its judgment on such question, and the said court shall on receipt thereof proceed to dispose of the case in conformity with such judgment.",
    "metadata": {
      "article": "224",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "constitutional interpretation",
        "high court powers",
        "case withdrawal",
        "article 224",
        "judicial supremacy"
      ]
    }
  },
  {
    "text": "The transfer of judges from one State to another shall be subject to the provisions of this Article.",
    "metadata": {
      "article": "225",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "judicial transfers",
        "high court",
        "article 225"
      ]
    }
  },
  {
    "text": "Every High Court shall have power, throughout the territories in relation to which it exercises jurisdiction, to issue to any person or authority, including in appropriate cases, any Government, within those territories directions, orders or writs, including writs in the nature of habeas corpus, mandamus, prohibition, quo warranto and certiorari, or any of them, for the enforcement of any of the rights conferred by Part III and for any other purpose. (2) The power conferred by clause (1) to issue directions, orders or writs to any Government, authority or person may also be exercised by any High Court exercising jurisdiction in relation to the territories within which the cause of action, wholly or in part, arises for the exercise of such power.",
    "metadata": {
      "article": "226",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "writ jurisdiction",
        "fundamental rights",
        "judicial powers",
        "high court",
        "article 226"
      ]
    }
  },
  {
    "text": "The High Court shall have superintendence over all courts and tribunals throughout the territories in relation to which it exercises jurisdiction.",
    "metadata": {
      "article": "227",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "supervisory jurisdiction",
        "courts and tribunals",
        "high court",
        "article 227"
      ]
    }
  },
  {
    "text": "If the High Court is satisfied that a case pending in a court subordinate to it involves a substantial question of law as to the interpretation of this Constitution, the determination of which is necessary for the disposal of the case, it shall withdraw the case and may—(a) either dispose of the case itself; or (b) determine the said question of law and return the case to the court from which the case has been so withdrawn together with a copy of its judgment on such question, and the said court shall on receipt thereof proceed to dispose of the case in conformity with such judgment.",
    "metadata": {
      "article": "228",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "constitutional interpretation",
        "case withdrawal",
        "high court powers",
        "article 228"
      ]
    }
  },
  {
    "text": "Without prejudice to the generality of the foregoing provision, the High Court may—(a) call for returns from such courts; (b) make and issue general rules and prescribe forms for regulating the practice and proceedings of such courts; and (c) prescribe forms in which books, entries and accounts shall be kept by the officers of any such courts.",
    "metadata": {
      "article": "229",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "high court administration",
        "judicial rules",
        "court procedure",
        "article 229"
      ]
    }
  },
  {
    "text": "The High Court may also settle tables of fees to be allowed to the sheriff and all clerks and officers of such courts and to attorneys, advocates and pleaders practising therein: Provided that any rules made, forms prescribed or tables settled under clause (2) or clause (3) shall not be inconsistent with the provision of any law for the time being in force, and shall require the previous approval of the Governor.",
    "metadata": {
      "article": "230",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "court fees",
        "advocates and officers",
        "governor approval",
        "high court regulation",
        "article 230"
      ]
    }
  },
  {
    "text": "Nothing in this article shall be deemed to confer on a High Court powers of superintendence over any court or tribunal constituted by or under any law relating to the Armed Forces.",
    "metadata": {
      "article": "231",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "armed forces tribunals",
        "high court limitation",
        "military jurisdiction",
        "article 231"
      ]
    }
  },
  {
    "text": "Establishment of a common High Court for two or more States.—(1) Notwithstanding anything contained in the preceding provisions of this Chapter, Parliament may by law establish a common High Court for two or more States or for two or more States and a Union territory. (2) In relation to any such High Court— (a) [Omitted] (b) the reference in article 227 to the Governor shall, in relation to any rules, forms or tables for subordinate courts, be construed as a reference to the Governor of the State in which the subordinate courts are situate; and (c) the references in articles 219 and 229 to the State shall be construed as a reference to the State in which the High Court has its principal seat: Provided that if such principal seat is in a Union territory, the references in articles 219 and 229 to the Governor, Public Service Commission, Legislature and Consolidated Fund of the State shall be construed respectively as references to the President, Union Public Service Commission, Parliament and Consolidated Fund of India.",
    "metadata": {
      "article": "231",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "common high court",
        "federal judiciary",
        "union territories",
        "judicial structure",
        "article 231"
      ]
    }
  },
  {
    "text": "Appointment of district judges.—(1) Appointments of persons to be, and the posting and promotion of, district judges in any State shall be made by the Governor of the State in consultation with the High Court exercising jurisdiction in relation to such State.",
    "metadata": {
      "article": "233",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "district judges",
        "judicial appointments",
        "governor consultation",
        "article 233"
      ]
    }
  },
  {
    "text": "Recruitment of persons other than district judges to the judicial service.—Appointments of persons other than district judges to the judicial service of a State shall be made by the Governor of the State in accordance with rules made by him in that behalf after consultation with the State Public Service Commission and with the High Court exercising jurisdiction in relation to such State.",
    "metadata": {
      "article": "234",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "judicial recruitment",
        "judicial service",
        "public service commission",
        "article 234"
      ]
    }
  },
  {
    "text": "Control over subordinate courts.—The control over district courts and courts subordinate thereto including the posting and promotion of, and the grant of leave to, persons belonging to the judicial service of a State and holding any post inferior to the post of district judge shall be vested in the High Court.",
    "metadata": {
      "article": "235",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "subordinate judiciary",
        "high court control",
        "judicial service",
        "article 235"
      ]
    }
  },
  {
    "text": "Interpretation.—In this Chapter—(a) the expression 'district judge' includes judge of a city civil court, additional district judge, assistant district judge, chief judge of a small cause court, chief presidency magistrate, additional chief presidency magistrate, sessions judge, additional sessions judge and assistant sessions judge; (b) the expression 'judicial service' means a service consisting exclusively of persons intended to fill the post of district judge and other civil judicial posts inferior to the post of district judge.",
    "metadata": {
      "article": "236",
      "part": "Part VI - High Courts (Arts. 214-231)",
      "tags": [
        "legal definitions",
        "judicial terminology",
        "district judiciary",
        "article 236"
      ]
    }
  },
  {
    "text": "Gram Sabha.—A Gram Sabha may exercise such powers and perform such functions at the village level as the Legislature of a State may, by law, provide.",
    "metadata": {
      "article": "243A",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "gram sabha",
        "village governance",
        "local self-government",
        "article 243A"
      ]
    }
  },
  {
    "text": "Constitution of Panchayats.—(1) There shall be constituted in every State, Panchayats at the village, intermediate and district levels in accordance with the provisions of this Part. (2) Notwithstanding anything in clause (1), Panchayats at the intermediate level may not be constituted in a State having a population not exceeding twenty lakhs.",
    "metadata": {
      "article": "243B",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat structure",
        "three-tier system",
        "local governance",
        "article 243B"
      ]
    }
  },
  {
    "text": "Composition of Panchayats.—(1) Subject to the provisions of this Part, the Legislature of a State may, by law, make provisions with respect to the composition of Panchayats. (2) The ratio between the population of the territorial area of a Panchayat and the number of seats in such Panchayat shall, so far as practicable, be the same throughout the State.",
    "metadata": {
      "article": "243C",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat composition",
        "electoral representation",
        "local bodies",
        "article 243C"
      ]
    }
  },
  {
    "text": "Reservation of seats.—(1) Seats shall be reserved for Scheduled Castes and Scheduled Tribes in every Panchayat in proportion to their population. (2) Not less than one-third of the total number of seats to be filled by direct election in every Panchayat shall be reserved for women.",
    "metadata": {
      "article": "243D",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat reservation",
        "social justice",
        "women representation",
        "SC/ST reservation",
        "article 243D"
      ]
    }
  },
  {
    "text": "Duration of Panchayats.—(1) Every Panchayat shall continue for five years from the date appointed for its first meeting. (2) An election to constitute a Panchayat shall be completed before the expiry of its duration or dissolution.",
    "metadata": {
      "article": "243E",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat tenure",
        "local elections",
        "five-year term",
        "article 243E"
      ]
    }
  },
  {
    "text": "Disqualifications for membership.—(1) A person shall be disqualified for being chosen as, and for being, a member of a Panchayat if he is so disqualified under any law for the time being in force relating to the elections to the Legislature of the State: Provided that no person shall be disqualified on the ground that he is less than twenty-five years of age if he has attained the age of twenty-one years. (2) If any question arises as to whether a member has become subject to any disqualification, the question shall be referred to such authority as the Legislature of the State may, by law, provide.",
    "metadata": {
      "article": "243F",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat disqualification",
        "membership eligibility",
        "electoral law",
        "article 243F"
      ]
    }
  },
  {
    "text": "Powers, authority and responsibilities of Panchayats.—Subject to the provisions of this Constitution, the Legislature of a State may, by law, endow the Panchayats with such powers and authority as may be necessary to enable them to function as institutions of self-government.",
    "metadata": {
      "article": "243G",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat powers",
        "self-governance",
        "decentralization",
        "article 243G"
      ]
    }
  },
  {
    "text": "Powers to impose taxes by, and Funds of, the Panchayats.—The Legislature of a State may, by law, authorize a Panchayat to levy, collect and appropriate taxes, duties, tolls and fees, and also assign to them certain revenues and grant-in-aid from the Consolidated Fund of the State.",
    "metadata": {
      "article": "243H",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "panchayat finance",
        "local taxation",
        "revenue powers",
        "article 243H"
      ]
    }
  },
  {
    "text": "Constitution of Finance Commission to review financial position.—The Governor of a State shall, within one year from the commencement of the Constitution (Seventy-third Amendment) Act, 1992 and thereafter at the expiration of every fifth year, constitute a Finance Commission to review the financial position of the Panchayats.",
    "metadata": {
      "article": "243I",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "finance commission",
        "panchayat finance",
        "devolution of funds",
        "article 243I"
      ]
    }
  },
  {
    "text": "Elections to the Panchayats.—(1) The superintendence, direction and control of the preparation of electoral rolls for, and the conduct of, all elections to the Panchayats shall be vested in a State Election Commission consisting of a State Election Commissioner to be appointed by the Governor. (2) The conditions of service and tenure of office of the State Election Commissioner shall be such as the Governor may by rule determine: Provided that the State Election Commissioner shall not be removed from his office except in like manner and on the like grounds as a Judge of a High Court. (3) The Governor shall, when so requested by the State Election Commission, make available to the State Election Commission such staff as may be necessary for the discharge of the functions conferred on the State Election Commission by clause (1). (4) Subject to the provisions of this Constitution, the Legislature of a State may, by law, make provision with respect to all matters relating to, or in connection with, elections to the Panchayats.",
    "metadata": {
      "article": "243K",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "state election commission",
        "panchayat elections",
        "electoral oversight",
        "article 243K"
      ]
    }
  },
  {
    "text": "Application to Union territories.—The provisions of this Part shall apply to the Union territories and shall, in their application to a Union territory, have effect as if the references to the Governor of a State were references to the Administrator of the Union territory appointed under article 239 and references to the Legislature or the Legislative Assembly of a State were references, in relation to a Union territory having a Legislative Assembly, to that Legislative Assembly: Provided that the President may, by public notification, direct that the provisions of this Part shall apply to any Union territory or part thereof subject to such exceptions and modifications as he may specify in the notification.",
    "metadata": {
      "article": "243L",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "union territories",
        "panchayat applicability",
        "constitutional adaptation",
        "article 243L"
      ]
    }
  },
  {
    "text": "Part not to apply to certain areas.—(1) Nothing in this Part shall apply to the Scheduled Areas referred to in clause (1), and the tribal areas referred to in clause (2), of article 244. (2) Nothing in this Part shall apply to— (a) the States of Nagaland, Meghalaya and Mizoram; (b) the hill areas in the State of Manipur for which District Councils exist under any law for the time being in force. (3) Nothing in this Part— (a) relating to Panchayats at the district level shall apply to the hill areas of the District of Darjeeling in the State of West Bengal for which Darjeeling Gorkha Hill Council exists under any law for the time being in force; (b) shall be construed to affect the functions and powers of the Darjeeling Gorkha Hill Council constituted under such law.",
    "metadata": {
      "article": "243M",
      "part": "Part IX - The Panchayats (Articles 243 to 243O)",
      "tags": [
        "exempted regions",
        "scheduled areas",
        "tribal governance",
        "darjeeling gorkha council",
        "article 243M"
      ]
    }
  },
  {
    "text": "Definitions.—In this Part, unless the context otherwise requires— (a) 'Committee' means a Committee constituted under article 243S; (b) 'district' means a district in a State; (c) 'Metropolitan area' means an area having a population of ten lakhs or more, comprised in one or more districts and consisting of two or more Municipalities or other contiguous areas, specified by the Governor by public notification to be a Metropolitan area for the purposes of this Part; (d) 'Municipality' means an institution of self-government constituted under article 243Q; (e) 'Panchayat' means a Panchayat constituted under article 243B; (f) 'population' means the population as ascertained at the last preceding census of which the relevant figures have been published.",
    "metadata": {
      "article": "243P",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "definitions",
        "urban governance",
        "municipality terms",
        "article 243P"
      ]
    }
  },
  {
    "text": "Constitution of Municipalities.—(1) There shall be constituted in every State— (a) a Nagar Panchayat (by whatever name called) for a transitional area; (b) a Municipal Council for a smaller urban area; (c) a Municipal Corporation for a larger urban area, in accordance with the provisions of this Part.",
    "metadata": {
      "article": "243Q",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "municipality types",
        "urban classification",
        "local bodies",
        "article 243Q"
      ]
    }
  },
  {
    "text": "Composition of Municipalities.—(1) Save as provided in clause (2), all the seats in a Municipality shall be filled by persons chosen by direct election from the territorial constituencies in the Municipal area and for this purpose each Municipal area shall be divided into territorial constituencies to be known as wards. (2) The Legislature of a State may, by law, provide— (a) for the representation in a Municipality of— (i) persons having special knowledge or experience in Municipal administration; (ii) the members of the House of the People and the members of the Legislative Assembly of the State representing constituencies which comprise wholly or partly the Municipal area; (iii) the members of the Council of States and the members of the Legislative Council of the State registered as electors within the Municipal area; (iv) the Chairpersons of the Committees constituted under clause (5) of article 243S: Provided that the persons referred to in paragraph (i) shall not have the right to vote in the meetings of the Municipality.",
    "metadata": {
      "article": "243R",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "municipal composition",
        "ward elections",
        "nominated members",
        "article 243R"
      ]
    }
  },
  {
    "text": "Constitution and composition of Wards Committees, etc.—(1) There shall be constituted Wards Committees, consisting of one or more wards within the territorial area of a Municipality having a population of three lakhs or more. (2) The Legislature of a State may, by law, make provision with respect to— (a) the composition and the territorial area of a Wards Committee; (b) the manner in which the seats in a Wards Committee shall be filled. (3) A member of a Municipality representing a ward within the territorial area of the Wards Committee shall be a member of that Committee. (4) Where a Wards Committee consists of— (a) one ward, the member representing that ward in the Municipality; or (b) two or more wards, one of the members representing such wards in the Municipality elected by the members of the Wards Committee, shall be the Chairperson of that Committee. (5) Nothing in this article shall be deemed to prevent the Legislature of a State from making any provision for the powers and responsibilities of a Wards Committee.",
    "metadata": {
      "article": "243S",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "wards committees",
        "urban decentralization",
        "municipal substructure",
        "article 243S"
      ]
    }
  },
  {
    "text": "Disqualifications for membership.—(1) A person shall be disqualified for being chosen as, and for being, a member of a Municipality— (a) if he is so disqualified by or under any law for the time being in force for the purposes of elections to the Legislature of the State concerned: Provided that no person shall be disqualified on the ground that he is less than twenty-five years of age, if he has attained the age of twenty-one years; (b) if he is so disqualified by or under any law made by the Legislature of the State.",
    "metadata": {
      "article": "243T",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "disqualifications",
        "municipal membership",
        "election eligibility",
        "article 243T"
      ]
    }
  },
  {
    "text": "Duration and dissolution of Municipalities.—The Legislature of a State may, by law, make provisions with respect to the duration of the Municipalities and their dissolution under specified circumstances.",
    "metadata": {
      "article": "243U",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "term limits",
        "municipal dissolution",
        "local governance tenure",
        "article 243U"
      ]
    }
  },
  {
    "text": "Power to impose taxes by, and Funds of, the Municipalities.—The Legislature of a State may, by law,— (a) authorise a Municipality to levy, collect and appropriate such taxes, duties, tolls and fees in accordance with such procedure and subject to such limits as may be specified.",
    "metadata": {
      "article": "243V",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "municipal finance",
        "taxation powers",
        "fund allocation",
        "article 243V"
      ]
    }
  },
  {
    "text": "Powers, authority and responsibilities of Municipalities, etc.—Subject to the provisions of this Constitution, the Legislature of a State may, by law, endow— (a) the Municipalities with such powers and authority as may be necessary to enable them to function as institutions of self-government, including— (i) the preparation of plans for economic development and social justice; (ii) the performance of functions and the implementation of schemes as may be entrusted to them including those in relation to the matters listed in the Twelfth Schedule; (b) the Committees with such powers and authority as may be necessary to enable them to carry out the responsibilities conferred upon them including those in relation to the matters listed in the Twelfth Schedule.",
    "metadata": {
      "article": "243W",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "powers and duties",
        "twelfth schedule",
        "urban self-governance",
        "article 243W"
      ]
    }
  },
  {
    "text": "Elections to the Municipalities.—(1) The superintendence, direction and control of the preparation of electoral rolls for, and the conduct of, all elections to the Municipalities shall be vested in the State Election Commission referred to in article 243K.(2) Subject to the provisions of this Constitution, the Legislature of a State may, by law, make provision with respect to all matters relating to, or in connection with, elections to the Municipalities.",
    "metadata": {
      "article": "243ZA",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "municipal elections",
        "state election commission",
        "electoral process",
        "article 243ZA"
      ]
    }
  },
  {
    "text": "Application to Union territories.—The provisions of this Part shall apply to the Union territories and shall, in their application to a Union territory, have effect as if the references to the Governor of a State were references to the Administrator of the Union territory appointed under article 239 and references to the Legislature or the Legislative Assembly of a State were references in relation to a Union territory having a Legislative Assembly, to that Legislative Assembly:Provided that the President may, by public notification, direct that the provisions of this Part shall apply to any Union territory or part thereof subject to such exceptions and modifications as he may specify in the notification.",
    "metadata": {
      "article": "243ZB",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "union territories",
        "constitutional adaptation",
        "administrator powers",
        "article 243ZB"
      ]
    }
  },
  {
    "text": "Part not to apply to certain areas.—(1) Nothing in this Part shall apply to the Scheduled Areas referred to in clause (1), and the tribal areas referred to in clause (2) of article 244.(2) Nothing in this Part shall be construed to affect the functions and powers of the Darjeeling Gorkha Hill Council constituted under any law for the time being in force for the hill areas of the district of Darjeeling in the State of West Bengal. (3) Notwithstanding anything in this Constitution, Parliament may, by law, extend the provisions of this Part to the Scheduled Areas and the tribal areas referred to in clause (1) subject to such exceptions and modifications as may be specified in such law, and no such law shall be deemed to be an amendment of this Constitution for the purposes of article 368.",
    "metadata": {
      "article": "243ZC",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "scheduled areas",
        "tribal governance",
        "darjeeling gorkha hill council",
        "constitutional exceptions",
        "article 243ZC"
      ]
    }
  },
  {
    "text": "Committee for district planning.—(1) There shall be constituted in every State at the district level a District Planning Committee to consolidate the plans prepared by the Panchayats and the Municipalities in the district and to prepare a draft development plan for the district as a whole.(2) The Legislature of a State may, by law, make provision with respect to—(a) the composition of the District Planning Committees;(b) the manner in which the seats in such Committees shall be filled:Provided that not less than four-fifths of the total number of members of such Committee shall be elected by, and from amongst, the elected members of the Panchayat at the district level and of the Municipalities in the district in proportion to the ratio between the population of the rural areas and of the urban areas in the district;(c) the functions relating to district planning which may be assigned to such Committees; (d) the manner in which the Chairpersons of such Committees shall be chosen.(3) Every District Planning Committee shall, in preparing the draft development plan,—(a) have regard to—(i) matters of common interest between the Panchayats and the Municipalities including spatial planning, sharing of water and other physical and natural resources, the integrated development of infrastructure and environmental conservation;(ii) the extent and type of available resources whether financial or otherwise;(b) consult such institutions and organisations as the Governor may, by order, specify.(4) The Chairperson of every District Planning Committee shall forward the development plan, as recommended by such Committee, to the Government of the State.",
    "metadata": {
      "article": "243ZD",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "district planning committee",
        "local planning",
        "panchayat-municipality coordination",
        "article 243ZD"
      ]
    }
  },
  {
    "text": "Committee for Metropolitan planning.—(1) There shall be constituted in every Metropolitan area a Metropolitan Planning Committee to prepare a draft development plan for the Metropolitan area as a whole.(2) The Legislature of a State may, by law, make provision with respect to—(a) the composition of the Metropolitan Planning Committees;(b) the manner in which the seats in such Committees shall be filled:Provided that not less than two-thirds of the members of such Committee shall be elected by, and from amongst, the elected members of the Municipalities and Chairpersons of the Panchayats in the Metropolitan area in proportion to the ratio between the population of the Municipalities and of the Panchayats in that area;(c) the representation in such Committees of the Government of India and the Government of the State and of such organisations and institutions as may be deemed necessary for carrying out the functions assigned to such Committees; (d) the functions relating to planning and coordination for the Metropolitan area which may be assigned to such Committees;(e) the manner in which the Chairpersons of such Committees shall be chosen.(3) Every Metropolitan Planning Committee shall, in preparing the draft development plan,—(a) have regard to—(i) the plans prepared by the Municipalities and the Panchayats in the Metropolitan area;(ii) matters of common interest between the Municipalities and the Panchayats, including coordinated spatial planning of the area, sharing of water and other physical and natural resources, the integrated development of infrastructure and environmental conservation;(iii) the overall objectives and priorities set by the Government of India and the Government of the State;(iv) the extent and nature of investments likely to be made in the Metropolitan area by agencies of the Government of India and of the Government of the State and other available resources whether financial or otherwise;(b) consult such institutions and organisations as the Governor may, by order, specify.(4) The Chairperson of every Metropolitan Planning Committee shall forward the development plan, as recommended by such Committee, to the Government of the State.",
    "metadata": {
      "article": "243ZE",
      "part": "Part IXA - The Municipalities (Articles 243P to 243ZG)",
      "tags": [
        "metropolitan planning committee",
        "urban planning",
        "municipality-panchayat coordination",
        "article 243ZE"
      ]
    }
  },
  {
    "text": "The provisions of this article shall have effect notwithstanding anything in any other provision of this Constitution or in any other law for the time being in force.\n\nTribunals for other matters.—(1) The appropriate Legislature may, by law, provide for the adjudication or trial by tribunals of any disputes, complaints, or offences with respect to all or any of the matters specified in clause (2) with respect to which such Legislature has power to make laws.\n\n(2) The matters referred to in clause (1) are the following, namely:—\n(a) levy, assessment, collection and enforcement of any tax;\n(b) foreign exchange, import and export across customs frontiers;\n(c) industrial and labour disputes;\n(d) land reforms by way of acquisition by the State of any estate as defined in article 31A or of any rights therein or the extinguishment or modification of any such rights or by way of ceiling on agricultural land or in any other way;\n(e) ceiling on urban property;\n(f) elections to either House of Parliament or the House or either House of the Legislature of a State, but excluding the matters referred to in article 329 and article 329A;\n(g) production, procurement, supply and distribution of food-stuffs (including edible oilseeds and oils) and such other goods as the President may, by public notification, declare to be essential goods for the purpose of this article and control of prices of such goods;\n(h) rent, its regulation and control and tenancy issues including the right, title and interest of landlords and tenants;\n(i) offences against laws with respect to any of the matters specified in sub-clauses (a) to (h) and fees in respect of any of those matters.",
    "metadata": {
      "article": "323B",
      "part": "Part XIVA - Tribunals",
      "tags": [
        "tribunals jurisdiction",
        "legislative powers",
        "adjudication of disputes",
        "article 323B"
      ]
    }
  }
]